---
kind: property
id: P:Autodesk.Revit.DB.Definition.ParameterGroup
source: html/0f094302-78d1-3d7b-e726-675aad7d1aea.htm
---
# Autodesk.Revit.DB.Definition.ParameterGroup Property

Returns the group ID of the parameter definition.

## Syntax (C#)
```csharp
[ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetGroupTypeId()` method instead.")]
public abstract BuiltInParameterGroup ParameterGroup { get; }
```